Revit 2027 API
ModelPathUtils.ConvertCloudGUIDsToCloudPath Method
 Converts a pair of cloud project and model GUIDs to a valid cloud path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ModelPath ConvertCloudGUIDsToCloudPath(
	string region,
	Guid projectGuid,
	Guid modelGuid
)
Public Shared Function ConvertCloudGUIDsToCloudPath (
	region As String,
	projectGuid As Guid,
	modelGuid As Guid
) As ModelPath
public:
static ModelPath^ ConvertCloudGUIDsToCloudPath(
	String^ region,
	Guid projectGuid,
	Guid modelGuid
)
static member ConvertCloudGUIDsToCloudPath :
        region : string *
        projectGuid : Guid *
        modelGuid : Guid -> ModelPath
Parameters
region String
 The region of cloud model. Please see the reference values, like CloudRegionUS and CloudRegionEMEA, and the new regions from release note.
projectGuid Guid
 The GUID of the cloud project which contains the model.
modelGuid Guid
 The GUID of the Revit cloud model.
Return Value
ModelPath
 The cloud model path.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
CentralModelException |  The cloud project is missing.
RevitServerCommunicationException |  The central server could not be reached.
RevitServerUnauthenticatedUserException |  You must sign in to complete action.
RevitServerUnauthorizedException |  You are unauthorized to access this resource.
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace